data = [['倉敷', '2016', '4', '119', '143', '1449', '546', '428', '4800', '4752', '1093', '1378', '713', '5892', '21313'],
        ['倉敷', '2016', '5', '119', '143', '737', '6225', '6273', '4063', '4039', '1236', '665', '95', '3231', '26825'],
        ['倉敷', '2016', '6', '24', '71', '333', '2685', '2804', '523', '499', '1117', '642', '119', '689', '9504'],
        ['倉敷', '2016', '7', '24', '71', '285', '95', '143', '1069', '903', '1140', '523', '143', '1069', '5465'],
        ['倉敷', '2016', '8', '48', '24', '48', '119', '119', '285', '285', '1164', '665', '119', '285', '3160']
      ]

      var array = [119, 143, 1449, 546, 428, 4800, 4752, 1093, 1378, 713, 5892];

      array.sort(function(a,b){
          return (a < b ? 1 : -1);
        });

var column_name = ['名', '年度', '月', '制服冬上', '制服冬下', 'Yシャツ', `制服夏上`, '制服夏下', '体操服上', '体操服下', '靴下', 'シューズ', '帽子', '体操帽', '合計']

function show_chart(dom){
  var myPieChart = new Chart(dom, {
 type: 'pie',
 data: {
   labels: ['制服冬上', '制服冬下', 'Yシャツ', `制服夏上`, '制服夏下', '体操服上', '体操服下', '靴下', 'シューズ', '帽子', '体操帽'],
   datasets: [{
       backgroundColor: [
           "#c2ecff",
           "#b2ecff",
           "#a2ecff",
           "#92ecff",
           "#82ecff",
           "#72ecff",
           "#62ecff",
           "#52ecff",
           "#42ecff",
           "#32ecff",
           "#22ecff",
       ],
       data: array
   }]
 },
 options: {
   responsive: true,
   maintainAspectRatio: false,
   title: {
     //display: true,
     text: '血液型 割合'
   }
 }
});
}
